---
kind: type
id: T:Autodesk.Revit.DB.Analysis.GenericZone
source: html/100b5109-f779-8cf8-81d1-cb6a5c0f4fa1.htm
---
# Autodesk.Revit.DB.Analysis.GenericZone

Provides access to the GenericZone Element in Autodesk Revit.

## Syntax (C#)
```csharp
public class GenericZone : Element
```

## Remarks
A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object.
 A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis.
 A generic zone will contain specific domain requirements provided at creation of the element.